app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-10-16 16:14:41.741308"], ["updated_at", "2018-10-16 16:14:41.741308"]]
---
  def create
    @student = Student.create(student_params)